<template>
  <div class="md-body">
    <h1>В этом приложении:</h1>
    <ul>
      <li>Полная настройка шаблона на Vue CLI</li>
      <li>Установка и настройка Vue-router для Vue.js 3</li>
      <li>Динамическая перерисовка без перезагрузки страницы</li>
      <li>Динамичный навбар и ссылки</li>
      <li>Обработка несуществующих роутов</li>
      <li>Хеши и моды для роутера</li>
      <li>Настройка общего конфига</li>
      <li>Работа с Rest API "Dummy Rest API Example"</li>
      <li>Реализована работа методов GET, POST, PUT, DELETE с использованием библиотеки axios</li>
      <li>Все запросы вынесены в services</li>
    </ul>
  </div>
</template>
